fe40/tutorials/rheoInterFoam/DieSwell/CarreauYasuda/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
phase1
{
      parameters
       {		        
                type            CarreauYasuda;
                
                rho             rho   [1 -3 0 0 0 0 0] .03;
                eta0            eta0   [ 1 -1 -1 0 0 0 0 ] 1e6; 
   		etaInf          etaInf  [ 1 -1 -1 0 0 0 0 ] 1e-3; 
   		k               k     [ 0 0 1 0 0 0 0 ] 1.389495494e7; 
   		n               n     [ 0 0 0 0 0 0 0 ] 0.3;   
   		a               a     [ 0 0 0 0 0 0 0 ] 2;
       }
}

phase2
{
     parameters
       {		        
         type            Newtonian;
         rho             rho [1 -3 0 0 0 0 0] 1.5e-4;
         eta             eta [1 -1 -1 0 0 0 0] 1e-3;
       }
}

passiveScalarProperties
{
                solvePassiveScalar   off;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.;

// ************************************************************************* //
